print()

print("================= raising Custom errors ====================")

print()








# a = int(input('enter any value : '))  # raising error

# if a>5 or a<9:
#     raise ValueError('value shoud be between 5 and 9')




"""
    
    
> বাংলাদেশের ঐতিহ্যবাহী খাবার হলো পিঠা। পিঠা তৈরির জন্য বিভিন্ন উপাদান লাগে, যেমন চালের গুঁড়া, ময়দা, চিনি, ঘি, ডিম ইত্যাদি। ঠিকঠাক উপাদান না থাকলে বা ঠিকমতো পদ্ধতি না মেনে পিঠা বানালে, পিঠা خراب হয়ে যেতে পারে।

 > ঠিক একইভাবে, প্রোগ্রাম চলার সময় কিছু ভুল হলেও এলার হয়। এলার হলে প্রোগ্রামটি থেমে যায় এবং একটি মেসেজ দেখায়, যেটি সমস্যা সমাধানে সাহায্য করে।

Python-এ বিভিন্ন ধরনের এলার আছে, যেমন:

SyntaxError: কোডে ভুল বানান বা ব্রাকেটের মতো চিহ্ন ঠিকমতো না লাগালে এই এলার হয়।
TypeError: ভুল ধরনের ডেটা ব্যবহার করলে এই এলার হয়।
ValueError: ভুল মান দেওয়া হলে এই এলার হয়।
কখনও কখনও, Python-এর ডিফল্ট এলার মেসেজগুলি আপনাকে সমস্যাটি সমাধান করতে সাহায্য নাও করতে পারে। এই ক্ষেত্রে, আপনি আপনার নিজের কাস্টম এলার তৈরি করতে পারেন।

কাস্টম এলার তৈরি করার পদ্ধতি:

একটি নতুন ক্লাস তৈরি করুন, যেটি Exception ক্লাস থেকে inherit করবে।
এই নতুন ক্লাসের একটি init met hod তৈরি করুন, যেটি একটি message argument গ্রহণ করবে।
message argument-এ আপনি যে এলার মেসেজটি দেখাতে চান, সেটি স্টোর করুন।
try block-এ আপনার কোড লিখুন।
যদি কোনো ভুল হয়, তাহলে raise আপনার কাস্টম এলার ক্লাসের একটি instance।
except block-এ আপনার কাস্টম এলার ক্লাসটি handle করুন।
   
   
   
   
    """














