print()


print("============================== Virtual Environment  ============================")


""" 
>> পাইথনে ভার্চুয়াল এনভিয়রনমেন্ট, বা আভাসী পরিবেশ হচ্ছে এক ধরনের পৃথক কোণ, 
    যেখানে আপনি নিজের প্রয়োজনীয় লাইব্রেরি ও প্যাকেজ ইনস্টল করে সেগুলোর নিয়ন্ত্রণ আপনার হাতে রাখতে পারেন।

>>  এটি ঠিক যেমন আপনার নিজের বাড়ি, 
    যেখানে আপনি যা ইচ্ছা তাই রাখতে পারেন এবং বাইরের পরিবেশের কোনো প্রভাব ছাড়াই আপনার প্রয়োজন অনুযায়ি সাজাতে পারেন।


"""
print()


#python -a venv myenv
#source myenv/bin/activate  >for linux and mac
#myenv\Scripts\activate.bat


#>deactive the virtual environmanet
#deactive




















































print()


