print()



print("=========================== Raising Custom Errors===========================")



print()



"""
> পাইথনে কাস্টম এলার বা ত্রুটি তোলা মানে হলো নিজের মতো করে ত্রুটির বার্তা তৈরি করে কোডের চলন বন্ধ করা

>  সাধারণত যখন কোন লজিক্যাল বুলিয়ান শর্ত এক্সিকিউট হয় না অথবা কোন ডেটা বা ইনপুট অযৌক্তিক হয়,
 তখন পাইথন ডিফল্ট এলার বার্তা দেখায়। 

>  কিন্তু কখনো কখনো আমাদের নিজের মতো করে বিস্তারিত এলার বার্তা দেখানো দরকার হয়, বিশেষ করে জটিল কোডে

কাস্টম এলার তোলার জন্য পাইথনে raise কিওয়ার্ড ব্যবহার করা হয়।
"""



print()






print("=========================== explain with AI ============================")


print()








def check_age(age):
  if age < 18:
    raise ValueError(">>> Your age is not True.")
  else:
    print(">> Your age is True .")

a = check_age(int(input("Enter the age :  ")))
print()





try:
  a
except ValueError as e:
  print(e)


print()




















































